import { Accordion } from "../../components/Accordion/Accordion";

const dataFaq = [
    {
      title: "Где можно узнать, с какими играми совместима фигурка amiibo?",
      content:
        "Подробная информация доступна на странице amiibo.",
    },
    {
      title: "Что мне нужно заказать, чтобы играть с amiibo?",
      content:
        "Вам потребуется фигурка amiibo, совместимая игра и совместимое устройство (Nintendo Switch, Wii U, New Nintendo 3DS, New Nintendo 3DS XL или New Nintendo 2DS XL). Другие системы Nintendo 3DS также совместимы с фигурками amiibo, однако вам потребуется устройство чтения/записи NFC Nintendo 3DS.",
    },
    {
      title: "Все ли фигурки amiibo работают со всеми совместимыми играми?",
      content:
        "Каждая фигурка amiibo по-своему работает только со своими совместимыми играми. Возьмем, к примеру, фигурку Марио: в игре Super Smash Bros. для Wii U игрок сможет сражаться вместе с ней, а в игре Mario Kart 8 — получить особый гоночный костюм Марио для образов Mii. Подробную информацию о возможностях, которые предоставляют фигурки amiibo для той или иной совместимой игры, вы можете найти на странице amiibo, на вкладке «Игры». Некоторые игры, например Super Smash Bros. для Wii U, будут сохранять в amiibo свои данные, тогда как другие, например Mario Kart 8 или Hyrule Warriors, предоставят бонусный контент за активацию amiibo на Wii U GamePad.",
    },
    {
      title: "Для чего нужны фигурки amiibo?",
      content:
        "Каждая amiibo предоставляет свои возможности, которые различаются в той или иной совместимой игре. Одни игры, например Super Smash Bros. для Wii U, сохраняют некоторые игровые данные в фигурку amiibo. Другие, например Mario Kart 8 или Hyrule Warriors, открывают специальный контент при активации фигурки на Wii U GamePad. Чтобы получить более подробную информацию, перейдите на страницу amiibo.",
    },
    {
      title:
        "Нужны ли для фигурок amiibo батарейки?",
      content:
        "Батарейки не нужны.",
    },
    {
      title:
        "Сколько игр можно одновременно сохранить в одной фигурке amiibo?",
      content:
        "На одной amiibo одновременно могут сохраняться данные только одной игры, так что перед использованием фигурки для другой игры с функцией чтения/записи предыдущие игровые данные придется стереть. ",
    },
    {
      title: "Обязательно ли нужна фигурка amiibo для того, чтобы играть в игры, совместимые с amiibo?",
      content:
        "В игры, совместимые с amiibo, можно играть и без фигурки. Использовать фигурку совсем не обязательно — это просто добавляет в игровой процесс новые элементы в зависимости от игры.",
    },
    {
      title: "Для чего нужно меню настроек amiibo на моей консоли Nintendo Switch?",
      content:
        "В этом меню вы можете связать фигурку amiibo с Mii и ником ее владельца, а также удалить игровые данные перед использованием фигурки для другой игры с функцией чтения/записи.",
    },
    {
      title:
        "Можно ли играть от лица персонажа amiibo в Super Smash Bros. для Wii U?",
      content:
        "В Super Smash Bros. у игроков появляется возможность играть против бойцов amiibo, объединяться с ними в команду или отправлять их в бой против фигурок их друзей в режиме многопользовательской игры. Игроки не могут напрямую управлять внутриигровыми бойцами amiibo.",
    },
  ];

export const FaqPage = () => {

    return (
        <div>
            <h1>Часто спрашивают</h1>
            {dataFaq.map((e, i) => (
            <Accordion key={i} title={e.title}>
                {e.content}
            </Accordion>
            ))}
        </div>
    )
}

// [].map((element)=> {
//     return element;
// });